English/nce3-2/L29 Funny or not.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-01-18 Thu 10:54 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="lenovo" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="outline-container-orgcee9837" class="outline-2">
<h2 id="orgcee9837">Lesson 29 Funny or not?</h2>
<div class="outline-text-2" id="text-orgcee9837">
<p class="verse">
What is the basis of 'sick' humour?<br />
<br />
Whether we find a joke funny or not largely depends on where we have been brought up.<br />
The sense of humour <b>is mysteriously bound up with</b> national characteristics.<br />
A Frenchman, for instance, might <b>find it hard to laugh</b> at a Russian joke.<br />
In the same way, a Russian might fail to see anything amusing in a joke<br />
&#xa0;which would make an Englishman <b>laugh to tears</b>.<br />
<br />
Most funny stories are based on comic situations.<br />
In spite of national differences, certain funny situations <b>have a universal appeal</b>.<br />
No matter where you live, you would find it difficult not to laugh at,<br />
&#xa0;say, Charlie Chaplin's early films.<br />
However, a new type of humour, which <b>stems largely from</b> the US, has recently <b>come into fashion</b>.<br />
It is called 'sick humour'.<br />
Comedians <b>base their jokes on</b> tragic situations like violent death or serious accidents.<br />
Many people find this sort of joke distasteful.<br />
The following example of 'sick humour' will enable you to <b>judge for yourself</b>.<br />
<br />
A man who had broken his right leg was taken to hospital a few weeks before Christmas.<br />
From the moment he arrived there,<br />
&#xa0;he kept on <b>pestering his doctor to tell</b> him when he would be able to go home.<br />
He <b>dreaded having</b> to spend Christmas in hospital.<br />
Though the doctor <b>did his best</b>, the patient's recovery was slow.<br />
On Christmas Day, the man still had his right leg in plaster.<br />
He spent a miserable day in bed thinking of all the fun he was missing.<br />
The following day, however, the doctor consoled him by telling him<br />
&#xa0;that his chances of being able to leave hospital in time for New Year celebrations were good.<br />
The man <b>took heart</b> and, sure enough, on New Year's Eve he was able to hobble along to a party.<br />
To <b>compensate for</b> his unpleasant experiences in hospital,<br />
&#xa0;the man drank a little more than <b>was good for him</b>.<br />
<b>In the process</b>, he enjoyed himself thoroughly<br />
&#xa0;and kept telling everybody how much he hated hospitals.<br />
He was still mumbling something about hospitals at the end of the party<br />
&#xa0;when he slipped on a piece of ice and broke his left leg.<br />
</p>
</div>

<div id="outline-container-orgc5490cf" class="outline-3">
<h3 id="orgc5490cf">words</h3>
<div class="outline-text-3" id="text-orgc5490cf">
<p>
largely [ˈlɑːrdʒli] adv. 在很大程度上<br />
comic [ˈkɑːmɪk] adj. 喜剧的,可笑的<br />
universal [ˌjuːnɪˈvɜːrs(ə)l] adj. 普遍的<br />
comedian [kəˈmiːdiən] n. 滑稽演员,喜剧演员<br />
distasteful [dɪsˈteɪstf(ə)l] adj. 讨厌的<br />
pester [ˈpestər] v. 一再要求,纠缠<br />
dread [dred] v. 惧怕<br />
recovery [rɪˈkʌvəri] n. 康复<br />
plaster [ˈplæstər] n. 熟石膏<br />
console [kənˈsoʊl] v. 安慰,慰问<br />
hobble [ˈhɑːb(ə)l] v. 瘸着退走<br />
compensate [ˈkɑːmpenseɪt] v. 补偿<br />
mumble [ˈmʌmb(ə)l] v. 喃喃自语<br />
</p>
</div>
</div>

<div id="outline-container-orgce3e80b" class="outline-3">
<h3 id="orgce3e80b">vocabulary</h3>
<div class="outline-text-3" id="text-orgce3e80b">
<p>
brought up: raised<br />
mysteriously bound up with: strangely connected to<br />
universal appeal: international attraction<br />
stems: comes<br />
come into fashion: become popular<br />
distasteful: unpleasant or offensive<br />
</p>
</div>
</div>
