English/nce3-2/L29 Funny or not.html

<div id="outline-container-org0962850" class="outline-3">
<h3 id="org0962850"><span class="done DONE">DONE</span> 单词造句</h3>
<div class="outline-text-3" id="text-org0962850">
<p>
largely adv.<br />
</p>
<ol class="org-ol">
<li>It is him who are largely responsible for the team's success, not you.<br /></li>
<li>We are largely likely to make a profit this year.<br /></li>
<li>I largely work with people who work in office.<br /></li>
<li>I largely read science fiction to my daughter before she sleeps.<br /></li>
<li>This largely indicates that she has got back to the ship.<br /></li>
</ol>
<p>
comic adj.n.漫画  comic book/movie/novel<br />
</p>
<ol class="org-ol">
<li>I spoted him reading comic books in the class.<br /></li>
<li>She claimed to have not read comic books in the class.<br /></li>
<li>Our parents always put the comic books in the same class as harmful.<br /></li>
<li>It is outrageous that she is interested in comic novels.<br /></li>
<li>My friend thrust his comic book into my hands.<br /></li>
</ol>
<p>
universal adj.  have a universal appeal<br />
</p>
<ol class="org-ol">
<li>The songs which he made in his youth have a universal appeal all over the world.<br /></li>
<li>It is all very well that a delicacy has a universal appeal.<br /></li>
<li>She claimed that snails have a universal appeal as a dish.<br /></li>
<li>We devised a plan to make a movie that has a universal appeal.<br /></li>
<li>Countless people have been influenced by a song which has a universal appeal.<br /></li>
</ol>
<p>
comedian n.<br />
</p>
<ol class="org-ol">
<li>Damn it. I have recognized the comedian as a normal person in the market.<br /></li>
<li>The comedian which play the role of a teacher gave us a surprise.<br /></li>
<li>The comedian was cast in the role of a kidnappered.<br /></li>
<li>The comedian proceed to stay out of the limelight.<br /></li>
<li>The comedian insisted that the paper should be written out in full.<br /></li>
</ol>
<p>
distasteful adj.<br />
</p>
<ol class="org-ol">
<li>I insisted that the woman who made such distasteful remarks apologize to us.<br /></li>
<li>You have played a joke on your husband at the party. I found this distasteful.<br /></li>
<li>Don't bring your custom to my mouth. I found it distasteful.<br /></li>
<li>If you found it distasteful, you should tell me.<br /></li>
<li>It was not until an hour after the police arrived on the scene<br />
that he stop making distasteful remark.<br /></li>
</ol>
<p>
pester v.  pester sb. to do sth.<br />
</p>
<ol class="org-ol">
<li>My wife has been pestering me to travel abroad.<br /></li>
<li>Because I pestered him to go to university, we eventually reached an agreement.<br /></li>
<li>Don't pester me to buy this or that product, I am under a lot of pressure.<br /></li>
<li>I am relieved to hear that he stop pestering his father to check the garage.<br /></li>
<li>My cat have been pestering me to play ball with her.<br /></li>
</ol>
<p>
dread v.  dread doing sth.  dread sb. doing sth.<br />
</p>
<ol class="org-ol">
<li>In fact, I really dread traveling abroad.<br /></li>
<li>I am under a lot of pressure and dread my boss ordering me to finish it.<br /></li>
<li>Much as she loved to go on a jourey, she dreaded asking his father for money.<br /></li>
<li>The thief caught sight of policemen in front of his house and dreaded getting back home.<br /></li>
<li>She woke up with a start and dreaded peeing in the midnight.<br /></li>
</ol>
<p>
recovery n.  make a complete/quick/speedy/slow recovery<br />
</p>
<ol class="org-ol">
<li>After an operation, he soon made a complete recovery.<br /></li>
<li>The fact that my cat made a slow recovery afflicted me a great deal.<br /></li>
<li>If you had an operation, you would make a complete recovery.<br /></li>
<li>He made a complete recovery, for he refused to follow his doctor's instructions.<br /></li>
<li>I'm glad that you made a full recovery.<br /></li>
</ol>
<p>
plaster n.<br />
</p>
<ol class="org-ol">
<li>She wasn't able to play truent from school, for her leg was still in plaster.<br /></li>
<li>As my foot was in plaster at that time, I have a perfect alibi.<br /></li>
<li>Whether my leg is in plaster or not is something that has no influence on taking the test.<br /></li>
<li>Whether my leg is in plaster or not doesn't prevent me from watching TV.<br /></li>
<li>Whether my leg is in plaster or not doesn't prevent me from being your husband.<br /></li>
</ol>
<p>
console v.  console sb./yourself that + &#x2026;<br />
</p>
<ol class="org-ol">
<li>I consoled myself that Miumiu is very dear to me.<br /></li>
<li>I consoled myself that I would get a good salary in the future.<br /></li>
<li>She consoled me that our daughter has said magic word.<br /></li>
<li>I consoled my wife that the girl just classified us as beggars.<br /></li>
<li>I consoled my wife that our son would soon take heart.<br /></li>
</ol>
<p>
hobble v.<br />
</p>
<ol class="org-ol">
<li>I was strucked by a ball and had to hobble home.<br /></li>
<li>As the medicine exerts some influence on him, he had to hobble across the park.<br /></li>
<li>A old lady hobbled to the store to get samples of perfume for nothing.<br /></li>
<li>The cat who is hobbling arose the pity of mine.<br /></li>
<li>It is anticipated that he would hobble home afther he was hurt in the game.<br /></li>
</ol>
<p>
compensate v.  compensate (for sth.) = make up for<br />
</p>
<ol class="org-ol">
<li>In the university, my breakfast used to be compensated by lunch.<br /></li>
<li>The busmen were compensated for better salary and less work time.<br /></li>
<li>My wife was compensated for a nice dress which she expected to buy for a long time.<br /></li>
<li>The fans of the singer were made up for some tickets.<br /></li>
<li>You will be made up for studying abroad.<br /></li>
</ol>
<p>
mumble v.<br />
</p>
<ol class="org-ol">
<li>He seems to be mumbling his lover's name in sleep.<br /></li>
<li>A woman who was making a speech in the open was mumbling, you made a spectacle of herself.<br /></li>
<li>If you mumbled at that time, you might make a spectacle of yourself.<br /></li>
<li>She was mumbling her cat's name to herself.<br /></li>
<li>In going to office, I always mumble names of my wife and my cat.<br /></li>
</ol>
</div>
</div>

<div id="outline-container-org98eef78" class="outline-3">
<h3 id="org98eef78"><span class="done DONE">DONE</span> 反复听电影片段直到懂关键句</h3>
<div class="outline-text-3" id="text-org98eef78">
</div>
</div>
<div id="outline-container-org2b2e9aa" class="outline-3">
<h3 id="org2b2e9aa"><span class="done DONE">DONE</span> 讲语法</h3>
<div class="outline-text-3" id="text-org2b2e9aa">
</div>
</div>
<div id="outline-container-org097bae2" class="outline-3">
<h3 id="org097bae2">复习二册语法(笔记或视频) &amp; 红皮书</h3>
</div>
