English/nce3-2/L29 Funny or not.org
** DONE 习惯用法造句
CLOSED: [2023-12-16 Sat 11:42]
be bound up with
1. My problems are bound up with my mother's departure when I was three.
2. His achivement is bound up with his philosophy.
3. His breaking world record is bound up with the support from his father.
4. Our progress will be bound up with our determination and plans.
5. High civilization is bound up with our educational development.
find it hard to do sth.
1. I found it hard to make a complete recovery.
2. He was assailed by a vendor and found it hard to get back to the ship.
3. My wife found it hard to reduce the price to $5.
4. He found it hard to throw up his arms in plaster.
5. I find it hard to get rid of the gangster who asked for protection money.
make sb. laugh to tears
1. The comedian went to great lengths to make his customers laugh to tears.
2. It should have made us laugh to tears.
3. My wife used to make me laugh to tears in our attic.
4. His little brother went to great lengths to prove that he had made his daughter laugh to tears.
5. He lives by making his customers laugh to tears.
stem from ...
1. This kind of jokes stem large from the U.S.
2. When he told me that this sort of biscuit stems from the U.S,
		 I question the wisdom of his judgement.
3. My problem stems from the fact that I was afflicted by anxieties every day.
4. His problem stems from the fact that he didn't pass the test.
5. My problem stems from the fact that I became envious of my wife.
come into fashion
1. It is said that long shirts come into fashion these days.
2. Long shirts do come into fashion in China.
3. As this kind of clothes come into fashion again, my wife got a better salary. 
4. I question the wisdom of buying this kind of clothes which came into fashion last year.
5. Whether you like it or not, it came into fashion again.
base a. on b.
1. The director based his movie on a science fiction which came into fashion.
2. It was not until a week after the book was published that the director based his film on this.
3. The writer based his novel on a story
		that a prizefighter and his pupil turned against each other.
4. He based his story on two countries which were at war with each other.
5. He based his story on an aristocrat who was born in 14th B.C.
judge for yourself
1. Leo grudged telling me the answer and asked me to judge for myself.
2. It is clear that you are able to judge for yourself.
3. He is so clever that he is quick to judge fro himself.
4. He has already judged for himself and made it official. 
5. Technically speaking, you have been judging for yourself all the time.
do one's best (to do sth.)
1. My wife claimed that she did her best to take care of me.
2. Jackie Ma told us not to do our best to do anything worthless.
3. There are countless people in China who do their best to achive their goals.
4. He does his best to prevent his family from living in poverty.
5. Obviously, Mendoza did his best and rose to fame swiftly.
be good for sb.
1. Reading a great deal is good for your English.
2. Working hard is good for us.
3. Running daily is good for my health.
4. It is clear that fresh fruits and vegetables are good for you.
5. Playing football is good for my health.
in the process
1. She was moving to New York and had an accident in the process.
2. Our company will make a profit in the process.
3. His rise in status happened in the process.
4. This special type of cat gained in popularity in the process.
5. The code has been cleaned up in the process.

** 跟读 50遍
** DONE Comprehension 反复练习
CLOSED: [2023-12-17 Sun 20:29]
** DONE Ask me if 写+读
CLOSED: [2023-12-17 Sun 20:36]
1. Our sense of humor is bound up with national characteristics. What
	 What is bound up with national characteristics?
	 What is our sense of humor bound up with?
2. A Frenchman will find it hard to laugh at a Russian joke. Why
	 Why will a Frenchman find it hard to laugh at a Russian joke?
3. Most funny stories are based on comic situations. What
	 What are based on comic situations?
	 What are most funny stories based on?
4. Certain funny situations have a universal appeal. Why
	 Why do certain funny situations have a universal appeal?
5. A new type of humor has recently come into fashion. What
	 What has recently come into fashion?
6. A man was taken to hospital a few weeks before Christmas. When
	 When was a man taken to hospital?
7. He dreaded having to spend Christmas in hospital. Where
	 Where did he dread having to spend Christmas?
8. The doctor said he could go home for New Year. When
	 When did the doctor say he could go home?
9. The man drank a little more than was good for him. How much
	 How much did the man drink?
10. He was mumbling about hospitals when he slipped on a piece of ice. What
		What was he mumbling about when he slipped on a piece of ice?
	
** DONE Summary Writting 写 & 对答案
CLOSED: [2023-12-17 Sun 20:47]
A man who had broken his right leg a few weeks before Christmas
	kept on pestering his doctor to tell him when he could go home,
	beacuse he didn't want to spend Christams in hospiatl.
As his recovery was slow, on Christmas Day, he spent a miserable day in bed.
The next day, the doctor told him that he may be able to leave hospital for New Year celebrations.
Sure enough, on New Year's Eve he managed to hobble along to a party.
To compensate for his experiences in hospital, he drank a little more.
In the process, he told everybody how much he hated hospitals.
When he slipped on a piece of ice and broke his left leg,
	he wast still mumbling somethings about hospitals.

A man broke his right leg just before Christmas and was taken to hospital.
He wanted to know when he could go home.
On Chirstams Day he was still in hospital with his leg in plaster,
	but there was a good chance of leaving hospital for the New Year.
In fact, he was out in time to go to a New Year's Eve party where he drank too much,
	slipped on a piece of ice and broke his left leg.

** DONE tell the story 口语复述
CLOSED: [2023-12-17 Sun 20:49]
