English/nce3-2/L29 Funny or not.html
<div id="outline-container-orge96c025" class="outline-3">
<h3 id="orge96c025"><span class="done DONE">DONE</span> 习惯用法造句</h3>
<div class="outline-text-3" id="text-orge96c025">
<p>
be bound up with<br />
</p>
<ol class="org-ol">
<li>My problems are bound up with my mother's departure when I was three.<br /></li>
<li>His achivement is bound up with his philosophy.<br /></li>
<li>His breaking world record is bound up with the support from his father.<br /></li>
<li>Our progress will be bound up with our determination and plans.<br /></li>
<li>High civilization is bound up with our educational development.<br /></li>
</ol>
<p>
find it hard to do sth.<br />
</p>
<ol class="org-ol">
<li>I found it hard to make a complete recovery.<br /></li>
<li>He was assailed by a vendor and found it hard to get back to the ship.<br /></li>
<li>My wife found it hard to reduce the price to $5.<br /></li>
<li>He found it hard to throw up his arms in plaster.<br /></li>
<li>I find it hard to get rid of the gangster who asked for protection money.<br /></li>
</ol>
<p>
make sb. laugh to tears<br />
</p>
<ol class="org-ol">
<li>The comedian went to great lengths to make his customers laugh to tears.<br /></li>
<li>It should have made us laugh to tears.<br /></li>
<li>My wife used to make me laugh to tears in our attic.<br /></li>
<li>His little brother went to great lengths to prove that he had made his daughter laugh to tears.<br /></li>
<li>He lives by making his customers laugh to tears.<br /></li>
</ol>
<p>
stem from &#x2026;<br />
</p>
<ol class="org-ol">
<li>This kind of jokes stem large from the U.S.<br /></li>
<li>When he told me that this sort of biscuit stems from the U.S,<br />
I question the wisdom of his judgement.<br /></li>
<li>My problem stems from the fact that I was afflicted by anxieties every day.<br /></li>
<li>His problem stems from the fact that he didn't pass the test.<br /></li>
<li>My problem stems from the fact that I became envious of my wife.<br /></li>
</ol>
<p>
come into fashion<br />
</p>
<ol class="org-ol">
<li>It is said that long shirts come into fashion these days.<br /></li>
<li>Long shirts do come into fashion in China.<br /></li>
<li>As this kind of clothes come into fashion again, my wife got a better salary.<br /></li>
<li>I question the wisdom of buying this kind of clothes which came into fashion last year.<br /></li>
<li>Whether you like it or not, it came into fashion again.<br /></li>
</ol>
<p>
base a. on b.<br />
</p>
<ol class="org-ol">
<li>The director based his movie on a science fiction which came into fashion.<br /></li>
<li>It was not until a week after the book was published that the director based his film on this.<br /></li>
<li>The writer based his novel on a story<br />
that a prizefighter and his pupil turned against each other.<br /></li>
<li>He based his story on two countries which were at war with each other.<br /></li>
<li>He based his story on an aristocrat who was born in 14th B.C.<br /></li>
</ol>
<p>
judge for yourself<br />
</p>
<ol class="org-ol">
<li>Leo grudged telling me the answer and asked me to judge for myself.<br /></li>
<li>It is clear that you are able to judge for yourself.<br /></li>
<li>He is so clever that he is quick to judge fro himself.<br /></li>
<li>He has already judged for himself and made it official.<br /></li>
<li>Technically speaking, you have been judging for yourself all the time.<br /></li>
</ol>
<p>
do one's best (to do sth.)<br />
</p>
<ol class="org-ol">
<li>My wife claimed that she did her best to take care of me.<br /></li>
<li>Jackie Ma told us not to do our best to do anything worthless.<br /></li>
<li>There are countless people in China who do their best to achive their goals.<br /></li>
<li>He does his best to prevent his family from living in poverty.<br /></li>
<li>Obviously, Mendoza did his best and rose to fame swiftly.<br /></li>
</ol>
<p>
be good for sb.<br />
</p>
<ol class="org-ol">
<li>Reading a great deal is good for your English.<br /></li>
<li>Working hard is good for us.<br /></li>
<li>Running daily is good for my health.<br /></li>
<li>It is clear that fresh fruits and vegetables are good for you.<br /></li>
<li>Playing football is good for my health.<br /></li>
</ol>
<p>
in the process<br />
</p>
<ol class="org-ol">
<li>She was moving to New York and had an accident in the process.<br /></li>
<li>Our company will make a profit in the process.<br /></li>
<li>His rise in status happened in the process.<br /></li>
<li>This special type of cat gained in popularity in the process.<br /></li>
<li>The code has been cleaned up in the process.<br /></li>
</ol>
</div>
</div>

<div id="outline-container-orgc063bd0" class="outline-3">
<h3 id="orgc063bd0">跟读 50遍</h3>
</div>
<div id="outline-container-org2e7148a" class="outline-3">
<h3 id="org2e7148a"><span class="done DONE">DONE</span> Comprehension 反复练习</h3>
<div class="outline-text-3" id="text-org2e7148a">
</div>
</div>
<div id="outline-container-org7e1cb8a" class="outline-3">
<h3 id="org7e1cb8a"><span class="done DONE">DONE</span> Ask me if 写+读</h3>
<div class="outline-text-3" id="text-org7e1cb8a">
<ol class="org-ol">
<li>Our sense of humor is bound up with national characteristics. What<br />
What is bound up with national characteristics?<br />
What is our sense of humor bound up with?<br /></li>
<li>A Frenchman will find it hard to laugh at a Russian joke. Why<br />
Why will a Frenchman find it hard to laugh at a Russian joke?<br /></li>
<li>Most funny stories are based on comic situations. What<br />
What are based on comic situations?<br />
What are most funny stories based on?<br /></li>
<li>Certain funny situations have a universal appeal. Why<br />
Why do certain funny situations have a universal appeal?<br /></li>
<li>A new type of humor has recently come into fashion. What<br />
What has recently come into fashion?<br /></li>
<li>A man was taken to hospital a few weeks before Christmas. When<br />
When was a man taken to hospital?<br /></li>
<li>He dreaded having to spend Christmas in hospital. Where<br />
Where did he dread having to spend Christmas?<br /></li>
<li>The doctor said he could go home for New Year. When<br />
When did the doctor say he could go home?<br /></li>
<li>The man drank a little more than was good for him. How much<br />
How much did the man drink?<br /></li>
<li>He was mumbling about hospitals when he slipped on a piece of ice. What<br />
What was he mumbling about when he slipped on a piece of ice?<br /></li>
</ol>
</div>
</div>

<div id="outline-container-org3e603b2" class="outline-3">
<h3 id="org3e603b2"><span class="done DONE">DONE</span> Summary Writting 写 &amp; 对答案</h3>
<div class="outline-text-3" id="text-org3e603b2">
<p>
A man who had broken his right leg a few weeks before Christmas<br />
	kept on pestering his doctor to tell him when he could go home,<br />
	beacuse he didn't want to spend Christams in hospiatl.<br />
As his recovery was slow, on Christmas Day, he spent a miserable day in bed.<br />
The next day, the doctor told him that he may be able to leave hospital for New Year celebrations.<br />
Sure enough, on New Year's Eve he managed to hobble along to a party.<br />
To compensate for his experiences in hospital, he drank a little more.<br />
In the process, he told everybody how much he hated hospitals.<br />
When he slipped on a piece of ice and broke his left leg,<br />
	he wast still mumbling somethings about hospitals.<br />
</p>

<p>
A man broke his right leg just before Christmas and was taken to hospital.<br />
He wanted to know when he could go home.<br />
On Chirstams Day he was still in hospital with his leg in plaster,<br />
	but there was a good chance of leaving hospital for the New Year.<br />
In fact, he was out in time to go to a New Year's Eve party where he drank too much,<br />
	slipped on a piece of ice and broke his left leg.<br />
</p>
</div>
</div>

<div id="outline-container-orga29f3b7" class="outline-3">
<h3 id="orga29f3b7"><span class="done DONE">DONE</span> tell the story 口语复述</h3>
<div class="outline-text-3" id="text-orga29f3b7">
</div>
</div>
