English/nce3-2/L29 Funny or not.org
** DONE composition 阅读 或 写作
CLOSED: [2023-12-17 Sun 20:58]
An aunt of mine lives in a small village in the country
	and tells this story of what happened to her once.
In order to understand the story, you should know a little about life in an English village.
For example, people often enjoy afternoon tea together,
	they still leave doors unlocked,
	and certain tradesmen are used to delivering goods and,
	with permission, leaving them inside the owner's house.
One day my aunt had invited some friends round for afternoon tea.
She had put some cakes in the oven to bake, and had gone upstairs to do some cleaning.
When she finished, she decided to have a bath before her friends arrived.

She was just about to get into the bath when she suddenly remembered the cakes.
She wrapped a bath towel round her, went down to the kitchen and took the cakes out of the oven.
Just then, there was a knock on the back door.
She was sure it was the baker,
	who would open the door, come in and leave the bread on the kitchen table.
She panicked, dashed into the cupboard under the stairs and closed the door.
Then, horrified, she heard footsteps coming to the cupboard.
The door opened and there stood the gasman who had come to read the meter
	-- which was in the cupboard.
My aunt blushed and said, 'I'm very sorry. I was expecting the baker.'
'Oh,' the gasman said."Sorry, madam".
He closed the door gently and left.

** Topics for discussion
