English/nce3-2/L29 Funny or not.html
<div id="outline-container-org43e7549" class="outline-3">
<h3 id="org43e7549"><span class="done DONE">DONE</span> composition 阅读 或 写作</h3>
<div class="outline-text-3" id="text-org43e7549">
<p>
An aunt of mine lives in a small village in the country<br />
	and tells this story of what happened to her once.<br />
In order to understand the story, you should know a little about life in an English village.<br />
For example, people often enjoy afternoon tea together,<br />
	they still leave doors unlocked,<br />
	and certain tradesmen are used to delivering goods and,<br />
	with permission, leaving them inside the owner's house.<br />
One day my aunt had invited some friends round for afternoon tea.<br />
She had put some cakes in the oven to bake, and had gone upstairs to do some cleaning.<br />
When she finished, she decided to have a bath before her friends arrived.<br />
</p>

<p>
She was just about to get into the bath when she suddenly remembered the cakes.<br />
She wrapped a bath towel round her, went down to the kitchen and took the cakes out of the oven.<br />
Just then, there was a knock on the back door.<br />
She was sure it was the baker,<br />
	who would open the door, come in and leave the bread on the kitchen table.<br />
She panicked, dashed into the cupboard under the stairs and closed the door.<br />
Then, horrified, she heard footsteps coming to the cupboard.<br />
The door opened and there stood the gasman who had come to read the meter<br />
	&#x2013; which was in the cupboard.<br />
My aunt blushed and said, 'I'm very sorry. I was expecting the baker.'<br />
'Oh,' the gasman said."Sorry, madam".<br />
He closed the door gently and left.<br />
</p>
</div>
</div>

<div id="outline-container-orgd729fd4" class="outline-3">
<h3 id="orgd729fd4">Topics for discussion</h3>
</div>
</div>
</div>
</body>
</html>
